# anvil default precision-vocabulary word list (issue #579)
#
# This is a SMALL curated default (~150 cross-domain precision words), NOT a
# comprehensive list. It exists so the vocab reminder tool
# (anvil/lib/vocab_reminder.py) works out of the box. The real value is in
# YOUR own list: drop a VOCABULARY.words.txt (a sibling of the doc declared
# as `voice.vocabulary` in your project BRIEF) and the tool prefers it.
#
# Format: one word per line. Lines starting with `#` and blank lines are
# ignored. These are words an author might already KNOW but not reach for —
# the tool is a REMINDER, not an injector. See VOCABULARY.template.md for the
# reminder-not-injector philosophy and the precision-over-novelty test.

# General precision vocabulary
adumbrate
ramify
inhere
obtain
supervene
foreground
elide
occlude
attenuate
amplify
calcify
ossify
sediment
crystallize
metabolize
recapitulate
foreclose
underwrite
undergird
scaffold
braid
thread
hinge
pivot
torque
ratchet
cleave
bifurcate
collapse
flatten
compress
distend
splay
nest
recurse
cascade
percolate
diffuse
saturate
decant
distill
winnow
sift
adjudicate
arbitrate
triangulate
interpolate
extrapolate
abstract
reify
instantiate
enumerate
delineate
demarcate
circumscribe
bracket
parenthesize
gloss
annotate
inflect
modulate
calibrate
tune
temper
season
inure
acclimate
habituate
sediment
freight
ballast
tether
moor
anchor
unmoor
slacken
taut
fray
unravel

# Physics / dynamics
eigenvalue
entanglement
decoherence
hysteresis
resonance
damping
equilibrium
metastable
phase-transition
criticality
nucleation
percolation
dissipation
entropy
gradient
flux
manifold
topology
symmetry
invariant
perturbation
attractor
bifurcation
chaotic
ergodic
adiabatic

# Philosophy / epistemics
epistemic
ontic
phenomenology
intersubjective
qualia
haecceity
aporia
dialectic
teleology
contingent
necessary
supervenient
defeasible
underdetermined
incommensurable
reflexive
recursive
emergent
reductive
holistic
normative
descriptive
prescriptive
tacit
salient

# Systems / AI / computation
adversarial
multiagent
alignment
corrigible
goodhart
overfit
regularize
generalize
ablation
substrate
affordance
bottleneck
throughput
latency
backpressure
idempotent
deterministic
stochastic
heuristic
greedy
amortize
memoize
cache
invalidate
provenance

# Economics / strategy
arbitrage
seigniorage
stagflation
externality
fungible
illiquid
counterparty
moat
flywheel
optionality
convexity
hedge
leverage
hysteresis
incumbent
defensible
commodified
disintermediate
rent-seeking
network-effect
